COMP1640_Coursework/app/Http/Controllers/CategoryController.php

    public function index()
    {
        $categories = Category::all();
        $users = User::all();
        $userRoles = UserRole::all();
---
select * from `categories`
select * from `users`
select * from `user_roles`

    public function destroy($id)
    {
        $categories =Category::find($id);
        $categories->delete();
---
delete from `categories` where `id` = 3