COMP1640_Coursework/app/Http/Controllers/DepartmentController.php

select * from `departments`
select * from `users`
select * from `user_roles`
---
    public function index()
    {
        $departments = Department::all();
        $users = User::all();
        $userRoles = UserRole::all();

delete from `departments` where `id` = 4
---
    public function destroy($id)
    {
        $departments =Department::find($id);
        $departments->delete();