COMP1640_Coursework/app/Http/Controllers/IdeaController.php

    public function index()
    {
        $ideas = Idea::query()->orderBy('created_at', 'DESC')->paginate(5);
        $comments = Comment::all();
        $categories = Category::all();
        $users = User::all();
---
select * from `ideas` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `ideas`
select * from `comments`
select * from `categories`
select * from `users`

    public function show($id)
    {
        $idea = Idea::find($id);
        $categories = Category::all();
        $idea->increment('views');
---
select * from `categories`
update `ideas` set `views` = `views` + 1, `ideas`.`updated_at` = '2021-11-01 07:16:58' where `id` = 8

    public function getLastestIdea(){
        $ideas = Idea::query()->orderBy('created_at', 'DESC')->paginate(5);
        $comments = Comment::all();
        $categories = Category::all();
        $users = User::all();
---
select * from `ideas` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `ideas`
select * from `comments`
select * from `categories`
select * from `users`

    public function getMostViewedIdea(){
        $ideas = Idea::query()->orderBy('views', 'DESC')->paginate(5);
        $comments = Comment::all();
        $categories = Category::all();
        $users = User::all();
---
select * from `ideas` order by `views` desc limit 5 offset 0
select count(*) as aggregate from `ideas`
select * from `comments`
select * from `categories`
select * from `users`

    public function getMostCommentIdea(){
        $ideas = Idea::query()->withCount('comments')->paginate(5);
        $comments = Comment::all();
        $categories = Category::all();
        $users = User::all();
---
select count(*) as aggregate from `ideas`
select * from `comments`
select * from `categories`
select * from `users`